app/helpers/sessions_helper.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_admin
    if session[:admin_id]
      @current_admin ||= Admin.find_by(id: session[:admin_id])

SELECT  "schuelers".* FROM "schuelers" WHERE "schuelers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_student
    if session[:student_id]
      @current_student ||= Schueler.find_by(id: session[:student_id])