app/helpers/sessions_helper.rb

  def current_admin
    if session[:admin_id]
      @current_admin ||= Admin.find_by(id: session[:user_id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT ?  [["LIMIT", 1]]