app/controllers/admins_controller.rb

  def create
    @admin = Admin.new(admin_params)
    if @admin.save
---
INSERT INTO "admins" ("name", "vorname", "mail", "number", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)

  def list
   @admin = Admin.all
---
SELECT "admins".* FROM "admins"