app/controllers/presentations_controller.rb

  def list
    @pres = Presentation.order("#{sort_col} #{sort_dir}")
---
SELECT "presentations".* FROM "presentations"