app/controllers/presentations_controller.rb

  def list
    @presentations = Presentation.all.order(:Name)
---
SELECT "presentations".* FROM "presentations" ORDER BY "presentations"."Name" ASC