app/controllers/schuelers_controller.rb

SELECT  "schuelers".* FROM "schuelers" WHERE "schuelers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Das Elektroauto der Zukunft"], ["LIMIT", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Gestaltung eines Albums"], ["LIMIT", 1]]
---
  def show
    @schueler = Schueler.find_by(id: session[:student_id])
    if @schueler.Selected == nil && @schueler.Selected1 == nil && @schueler.Selected2 == nil
      redirect_to error_path
    else
      @pres0 = Presentation.find_by(Titel: @schueler.Selected)
      @pres1 = Presentation.find_by(Titel: @schueler.Selected1)
      @pres2 = Presentation.find_by(Titel: @schueler.Selected2)

SELECT  "schuelers".* FROM "schuelers" WHERE "schuelers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Erstellung einer gefälschten Persönlichkeit"], ["LIMIT", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Das Elektroauto der Zukunft"], ["LIMIT", 1]]
---
  def confirm
    @schueler = Schueler.find_by(id: session[:student_id])
    @pres0 = Presentation.find_by(Titel: @schueler.Selected)
    @pres1 = Presentation.find_by(Titel: @schueler.Selected1)
    @pres2 = Presentation.find_by(Titel: @schueler.Selected2)

SELECT  "schuelers".* FROM "schuelers" WHERE "schuelers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "schuelers" SET "Selected" = ?, "updated_at" = ? WHERE "schuelers"."id" = ?  [["Selected", nil], ["updated_at", "2018-09-04 13:22:27.421817"], ["id", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Das Elektroauto der Zukunft"], ["LIMIT", 1]]
UPDATE "presentations" SET "Frei" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Frei", 6], ["updated_at", "2018-09-04 13:22:27.527474"], ["id", 3]]
UPDATE "schuelers" SET "Selected1" = ?, "updated_at" = ? WHERE "schuelers"."id" = ?  [["Selected1", nil], ["updated_at", "2018-09-04 13:22:29.189135"], ["id", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Erstellung einer gefälschten Persönlichkeit"], ["LIMIT", 1]]
UPDATE "presentations" SET "Frei" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Frei", 6], ["updated_at", "2018-09-04 13:22:29.290879"], ["id", 1]]
UPDATE "schuelers" SET "Selected2" = ?, "updated_at" = ? WHERE "schuelers"."id" = ?  [["Selected2", nil], ["updated_at", "2018-09-04 13:22:25.727911"], ["id", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Gestaltung eines Albums"], ["LIMIT", 1]]
UPDATE "presentations" SET "Frei" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Frei", 6], ["updated_at", "2018-09-04 13:22:25.818262"], ["id", 2]]
---
  def delfromdb
    @schueler = Schueler.find_by(id: session[:student_id])
    titl = params[:commit]
    if params[:commit] == @schueler.Selected
      @schueler.update_attribute(:Selected, nil)
      pres = Presentation.find_by(Titel: titl)
      pres.Frei = pres.update_attribute(:Frei, pres.Frei + 1)
      redirect_to studenten_waehlen_path
    elsif params[:commit] == @schueler.Selected1
      @schueler.update_attribute(:Selected1, nil)
      pres = Presentation.find_by(Titel: titl)
      pres.Frei = pres.update_attribute(:Frei, pres.Frei + 1)
      redirect_to studenten_waehlen_path
    elsif params[:commit] == @schueler.Selected2
      @schueler.update_attribute(:Selected2, nil)
      pres = Presentation.find_by(Titel: titl)
      pres.Frei = pres.update_attribute(:Frei, pres.Frei + 1)

SELECT  "schuelers".* FROM "schuelers" WHERE "schuelers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "schuelers" SET "Registered" = ?, "updated_at" = ? WHERE "schuelers"."id" = ?  [["Registered", 1], ["updated_at", "2018-09-04 13:14:08.060078"], ["id", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Das Elektroauto der Zukunft"], ["LIMIT", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Erstellung einer gefälschten Persönlichkeit"], ["LIMIT", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Gestaltung eines Albums"], ["LIMIT", 1]]
UPDATE "presentations" SET "Besucher" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Besucher", ",Edward Lancaster"], ["updated_at", "2018-09-04 13:14:08.176304"], ["id", 3]]
UPDATE "schuelers" SET "updated_at" = ?, "password_digest" = ? WHERE "schuelers"."id" = ?  [["updated_at", "2018-09-04 13:14:08.242482"], ["password_digest", ":)"], ["id", 1]]
---
  def sendfile
    schueler = Schueler.find_by(id: session[:student_id])
    schueler.update_attribute(:Registered, true)
    pres0 = Presentation.find_by(Titel: schueler.Selected)
    pres1 = Presentation.find_by(Titel: schueler.Selected1)
    pres2 = Presentation.find_by(Titel: schueler.Selected2)
    pres0.update_attribute(:Besucher, "#{pres0.Besucher}," + "#{schueler.Vorname} " + "#{schueler.Name}")
    # Send email to student and to teacher
    schueler.update_attribute(:password_digest, ":)")

INSERT INTO "schuelers" ("Vorname", "Name", "Klasse", "Mail", "Number", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @schueler = Schueler.new(schueler_params)
    if @schueler.save

SELECT "schuelers".* FROM "schuelers" ORDER BY "schuelers"."Name" ASC
---
  def list
    @student = Schueler.all.order(:Name)

SELECT "schuelers".* FROM "schuelers" ORDER BY "schuelers"."Vorname" ASC
---
  def listfn
    @student = Schueler.all.order(:Vorname)

SELECT "schuelers".* FROM "schuelers" ORDER BY "schuelers"."Klasse" ASC
---
  def listkl
    @student = Schueler.all.order(:Klasse)

SELECT "schuelers".* FROM "schuelers" ORDER BY "schuelers"."Registered" ASC
---
  def listst
    @student = Schueler.all.order(:Registered)