app/controllers/schuelers_controller.rb

SELECT "schuelers".* FROM "schuelers"
---
  def list # Following functions sorts students
    @student = Schueler.order("#{sort_col} #{sort_dir}")