app/controllers/selections_controller.rb

SELECT "presentations".* FROM "presentations" ORDER BY "presentations"."Name" ASC
---
  def list
    @presentations = Presentation.all.order(:Name)

SELECT "presentations".* FROM "presentations" ORDER BY "presentations"."Betreuer" ASC
---
  def listb
    @presentations = Presentation.all.order(:Betreuer)

SELECT "presentations".* FROM "presentations" ORDER BY "presentations"."Fach" ASC
---
  def listf
    @presentations = Presentation.all.order(:Fach)

SELECT "presentations".* FROM "presentations" ORDER BY "presentations"."Klasse" ASC
---
  def listk
    @presentations = Presentation.all.order(:Klasse)

SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Gestaltung eines Albums"], ["LIMIT", 1]]
---
  def listt
    @presentations = Presentation.all.order(:Titel)

SELECT  "schuelers".* FROM "schuelers" WHERE "schuelers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "schuelers" SET "Selected" = ?, "updated_at" = ? WHERE "schuelers"."id" = ?  [["Selected", "Das Elektroauto der Zukunft"], ["updated_at", "2018-09-04 14:11:22.400942"], ["id", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Das Elektroauto der Zukunft"], ["LIMIT", 1]]
UPDATE "presentations" SET "Frei" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Frei", 4], ["updated_at", "2018-09-04 14:11:22.491367"], ["id", 3]]
UPDATE "schuelers" SET "Selected1" = ?, "updated_at" = ? WHERE "schuelers"."id" = ?  [["Selected1", "Erstellung einer gefälschten Persönlichkeit"], ["updated_at", "2018-09-04 14:11:23.328437"], ["id", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Erstellung einer gefälschten Persönlichkeit"], ["LIMIT", 1]]
UPDATE "presentations" SET "Frei" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Frei", 4], ["updated_at", "2018-09-04 14:11:23.414360"], ["id", 1]]
UPDATE "schuelers" SET "Selected2" = ?, "updated_at" = ? WHERE "schuelers"."id" = ?  [["Selected2", "Gestaltung eines Albums"], ["updated_at", "2018-09-04 14:11:24.389779"], ["id", 1]]
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."Titel" = ? LIMIT ?  [["Titel", "Gestaltung eines Albums"], ["LIMIT", 1]]
UPDATE "presentations" SET "Frei" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Frei", 4], ["updated_at", "2018-09-04 14:11:24.500418"], ["id", 2]]
---
  def addtodb
    @schueler = Schueler.find_by(id: session[:student_id])
    if @schueler.Selected == nil
      prestitle = params[:commit]
      @schueler.update_attribute(:Selected, prestitle)
      pres = Presentation.find_by(Titel: prestitle)
      pres.update_attribute(:Frei, pres.Frei - 1)
      redirect_to studenten_waehlen_path
    elsif @schueler.Selected != nil && @schueler.Selected1 == nil
      prestitle = params[:commit]
      @schueler.update_attribute(:Selected1, prestitle)
      pres = Presentation.find_by(Titel: prestitle)
      pres.update_attribute(:Frei, pres.Frei - 1)
      redirect_to studenten_waehlen_path
    elsif @schueler.Selected != nil && @schueler.Selected1 != nil && @schueler.Selected2 == nil
      prestitle = params[:commit]
      @schueler.update_attribute(:Selected2, prestitle)
      pres = Presentation.find_by(Titel: prestitle)
      pres.update_attribute(:Frei, pres.Frei - 1)