app/controllers/selections_controller.rb

  def list # Sorting functions for student selection database
    if @current_student.Selected != nil && @current_student.Selected1 != nil && @current_student.Selected2 != nil
      redirect_to studenten_clean_path
    else
      @presentations = Presentation.order("#{sort_col} #{sort_dir}")
---
SELECT "presentations".* FROM "presentations"