app/controllers/sessions_stud_controller.rb

SELECT  "schuelers".* FROM "schuelers" WHERE "schuelers"."number" = ? LIMIT ?  [["number", "s9362"], ["LIMIT", 1]]
---
  def create
    schueler = Schueler.find_by(number: params[:session][:number].downcase)