app/controllers/sessions_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."number" = ? LIMIT ?  [["number", "s9362"], ["LIMIT", 1]]
---
  def create # Creates session for admins
    mildstudestroy
    admin = Admin.find_by(number: params[:session][:number].downcase)

SELECT  "schuelers".* FROM "schuelers" WHERE "schuelers"."number" = ? LIMIT ?  [["number", "s9362"], ["LIMIT", 1]]
---
  def studcreate # Creates session for students
    mildestroy
    schueler = Schueler.find_by(number: params[:session][:number].downcase)