app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers" ORDER BY "teachers"."name" ASC
---
  def list
    @teacher = Teacher.all.order(:name)