app/models/presentation.rb

  def self.import(file)
    CSV.foreach(file.path, headers: true) do |row|
      Presentation.create! row.to_hash
    end
    presentations = Presentation.all
    presentations.each do |row|
        row.update_attribute(:Besetzt, 0)
        row.update_attribute(:Besucher, nil)
---
INSERT INTO "presentations" ("Name", "Klasse", "Titel", "Fach", "Betreuer", "Zimmer", "Von", "Bis", "Datum", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "presentations".* FROM "presentations"
UPDATE "presentations" SET "Besetzt" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Besetzt", 0], ["updated_at", "2018-09-02 08:51:18.447313"], ["id", 1]]
UPDATE "presentations" SET "Besetzt" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["Besetzt", 0], ["updated_at", "2018-09-02 18:08:39.348813"], ["id", 4]]