app/models/schueler.rb

INSERT INTO "schuelers" ("Vorname", "Name", "Klasse", "Mail", "Number", "Code", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "schuelers" ("Vorname", "Name", "Klasse", "Mail", "Number", "Code", "Registered", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def self.import(file)
    table = CSV.read(file.path, { headers: true, col_sep: ";" })

    table.each do |row| # Generates password for each user and marks selection as nil
      pass = 1.times.map{ 9999 + Random.rand(100000) }
      row["password"] = pass.join
      row["password_confirmation"] = pass.join
      row["Code"] = pass.join
      row["Registered"] = false
      row["Selected"] = nil
      row["Selected1"] = nil
      row["Selected2"] = nil
    end

    CSV.open(file.path, "w") do |f|
      f << table.headers
      table.each{ |row| f << row }
    end

    CSV.foreach(file.path, headers: true) do |row|
      Schueler.create! row.to_hash