app/models/teacher.rb

  def self.import(file)
    CSV.foreach(file.path, headers:true) do |row|
      Teacher.create! row.to_hash
---
INSERT INTO "teachers" ("Name", "Mail", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Name", "Petra Holzheu"], ["Mail", "ph@bks.ch"], ["created_at", "2018-09-04 07:32:14.932492"], ["updated_at", "2018-09-04 07:32:14.932492"]]